---
layout: post
title: "titanium跨平台开发之路"
description: "tiantaium"
category: "跨平台"
tags: [titanium]
---

对于我来说是真正的算上是项目来说就是上一次用titanium跨平台开发的hrool  
虽然来说是直接胎死腹中吧，单也毕竟是真正的项目。也学到了不少东西，这次半途  
插入的项目仍然是titanium的项目，这次的项目在业务上比较复杂，技术上面难点还好  
吧，目前一期版本也已经上线了，虽说是android的版本，ios在调整，整体感觉开发的  
速度还行。总结以下titanium开发吧    

+ apk包太大，毕竟是用于js写的，轻轻松松40M，这让很多手机根本跑不动。 
+ 实现一些底层的功能，titanium是难以胜任的，都要通过写第三方module，这就大大的增加了技术难度（需要写两套）
+ 另外的就是titanium在做界面上也比较费劲，虽说titanium有可视化的插件，毕竟要钱的。。。
+ 我感觉最最大的问题吧就是它在国内普及太低，很难查到中文的相关资料，国外虽说多点，但在开发中也有很多问题
难以解决。  
---  
我个人吧，对于新的东西并不排斥，希望这个nx的东西赶紧普及起来，让跨平台真正的飞起来。



